app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs" ORDER BY "songs"."id" ASC

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("name", "artist", "album", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "poop"], ["artist", "poop"], ["album", "poop"], ["time", "poop"], ["created_at", "2021-02-26 17:42:19.034288"], ["updated_at", "2021-02-26 17:42:19.034288"]]

  def update
    if @song.update(song_params)
---
UPDATE "songs" SET "favorite" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["favorite", true], ["updated_at", "2021-02-26 19:16:04.367633"], ["id", 8]]